Import Depencies

In [1]:
from bs4 import BeautifulSoup
import requests
import os
import pandas as pd
import numpy as np

Set header to circumvent webscraping blocker

In [2]:
headers = {
    "User-agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.120 Safari/537.36"}

Create lists to store **responses**

In [3]:
# data to scrape
job_title = []
company_name = []
short_description = []
job_location = []
job_classification = []
job_subclassification = []

job_counter = 0

Scrape the website

In [4]:
url = 'https://www.seek.com.au/jobs-in-construction/in-All-Perth-WA'
response = requests.get(url)
soup = BeautifulSoup(response.content, features='html.parser')
jobs_on_page = soup('article')

Create list of job fields

In [5]:
job_field = ['construction', 'engineering', 'healthcare-medical', 'sales']

Scrape data

In [6]:
for x in job_field: 
    url = 'https://www.seek.com.au/jobs-in-' + x + '/in-All-Perth-WA'
    response = requests.get(url)
    soup = BeautifulSoup(response.content, features='html.parser')
    jobs_on_page = soup('article')
        
    for i in range(len(jobs_on_page)):

                job_counter += 1
                
                job_title.append(soup('article')[i]['aria-label'])

                short_description.append(soup('article')[i].find('span', {'data-automation':'jobShortDescription'}).text)
                job_location.append(soup('article')[i].find('a', {'data-automation':'jobLocation'}).text)
                job_subclassification.append(soup('article')[i].find('a', {'data-automation':'jobSubClassification'}).text)
                job_classification.append(soup('article')[i].find('a', {'data-automation':'jobClassification'}).text)
                
                print('Jobs scraped: %d' % job_counter, end='\r')
                
                try:
                    company_name.append(soup('article')[i].find('a', {'data-automation':'jobCompany'}).text)
                except:
                    company_name.append(np.nan)

-------

## Columns 

1.	Job title
2.	Company
3.	Description
4.	Location

In [7]:
print(len(company_name))
print(len(job_title))
print(len(short_description))

88
88
88

In [8]:
first_data = {'job_title': job_title,
            'company_name': company_name,
            'short_description': short_description,
            'job_location': job_location,
            'job_classification': job_classification,
            'job_subclassification': job_subclassification
             }

In [9]:
first_data_df = pd.DataFrame(first_data)
first_data_df.describe()

,job_title,company_name,short_description,job_location,job_classification,job_subclassification
count,88,86,88,88,88,88
unique,81,75,85,29,4,26
top,Graduate Engineer,Cleanaway Operations Pty Ltd,Provide key single point account management wi...,Perth WA,Healthcare & Medical,Medical Administration
freq,3,4,3,36,22,9

### Count words to plot

-----

In [10]:
# count, tally and describe words in short_description

description_count_df = (first_data_df['short_description'].str.split(expand=True)
              .stack()
              .value_counts()
              .rename_axis('vals')
              .reset_index(name='count'))

In [11]:
description_count_df

           vals  count
0           and     57
1            to     54
2             a     53
3           the     41
4            in     37
..          ...    ...
702  performing      1
703     outback      1
704     Venture      1
705   hospital.      1
706   territory      1

[707 rows x 2 columns]

### Create dataframes for tables

-----

### Connect to postgres and load data to db

-----